[
{"text":"The Messenger of Allah (saw) said: Whoever forgets a prayer, let him pray it when he remembers it.","reference":"Sunan An-Nasai"},
{"text":"The Prophet said, \"All drinks that produce intoxication are Haram (forbidden to drink).","reference":"Sahih Bukhari"},
{"text":"Whenever the Prophet got up at night, he used to clean his mouth with Siwak.","reference":"Sahih Bukhari"},
{"text":"Allah's Apostle said, \"If anyone of you enters a mosque, he should pray two Rakat before sitting.\"","reference":"Sahih Bukhari"},
{"text":"Allah's Apostle said, \"Whenever you hear the Adhan, say what the Muadhin is saying.","reference":"Sahih Bukhari"},
{"text":"The Prophet said, \"If supper is served, and Iqama is pronounced one should start with the supper.\"","reference":"Sahih Bukhari"},
{"text":"The Prophet used to pray a short prayer (in congregation) but used to offer it in a perfect manner.","reference":"Sahih Bukhari"},
{"text":"The Prophet said, \"Straighten your rows or Allah will alter your faces.\"","reference":"Sahih Bukhari"},
{"text":"Allah's Apostle said, \"Whoever does not recite Al-Fatiha in his prayer, his prayer is invalid.\"","reference":"Sahih Bukhari"},
{"text":"Allah's Apostle (p.b.u.h) said, \"Anyone of you attending the Friday (prayers) should take a bath.\"","reference":"Sahih Bukhari"},
{"text":"Whenever Allah's Apostle saw the rain, he used to say, \"O Allah! Let it be a strong fruitful rain.\"","reference":"Sahih Bukhari"},
{"text":"Whenever the Prophet got up for Tahajjud prayer he used to clean his mouth (and teeth) with Siwak.","reference":"Sahih Bukhari"},
{"text":"The Prophet used to lie down on his right side, after offering two Rakat (Sunna) of the Fajr prayer.","reference":"Sahih Bukhari"},
{"text":"Allah's Apostle said, \"Offer some of your prayers in your houses and do not make them graves.\"","reference":"Sahih Bukhari"},
{"text":"Allah's Apostle said, \"Between my house and the pulpit there is a garden of the gardens of Paradise.\"","reference":"Sahih Bukhari"},
{"text":"The Prophet said, \"The real patience is at the first stroke of a calamity.\"","reference":"Sahih Bukhari"},
{"text":"The Prophet ordered the people to pay Zakat-ul-Fitr before going to the Eid prayer.","reference":"Sahih Bukhari"},
{"text":"The Prophet said, \"O Allah! Bestow on Medina twice the blessings You bestowed on Makkah.\"","reference":"Sahih Bukhari"},
{"text":"Allah's Apostle said, \"When Ramadan begins, the gates of Paradise are opened.\"","reference":"Sahih Bukhari"},
{"text":"Allah's Apostle used to practise Itikaf in the last ten days of the month of Ramadan.","reference":"Sahih Bukhari"},
{"text":"The Prophet (SAW) said, \"Az-Zulm (Oppression) will be a darkness on the Day of Resurrection.\"","reference":"Sahih Bukhari"},
{"text":"Allah's Messenger used to accept gifts and used to give something in return.","reference":"Sahih Bukhari"},
{"text":"The Prophet (SAW) said, \"He who takes back his present is like him who swallows his vomit.\"","reference":"Sahih Bukhari"},
{"text":"The Prophet (SAW) said, \"Plague is the cause of martyrdom of every Muslim (who dies because of it).\"","reference":"Sahih Bukhari"},
{"text":"The Prophet said, \"None of you will have faith till he wishes for his (Muslim) brother what he likes for himself.\"","reference":"Sahih Bukhari"},
{"text":"The Prophet said \"None of you will have faith till he loves me more than his father, his children and all mankind.\"","reference":"Sahih Bukhari"},
{"text":"Allah's Apostle said, 'Whoever prays the two cool prayers ('Asr and Fajr) will go to Paradise.'","reference":"Sahih Bukhari"},
{"text":"The Prophet said, \"The prayer in congregation is twenty-five times superior to the prayer offered by person alone.\"","reference":"Sahih Bukhari"},
{"text":"The Prophet (saw) said to Abu-Dhar, \"Listen and obey (your chief) even if he is an Ethiopian with a head like a raisin.\"","reference":"Sahih Bukhari"},
{"text":"Allah's Apostle said, \"You will be rewarded for whatever you spend for Allah's sake even if it were a morsel which you put in your wife's mouth.\"","reference":"Sahih Bukhari"},
{"text":"The Prophet said, \"If anyone of you feels drowsy while praying, he should sleep till he understands what he is saying (reciting).\"","reference":"Sahih Bukhari"},
{"text":"The Prophet said, \"Straighten your rows as the straightening of rows is essential for a perfect and correct prayer.\"","reference":"Sahih Bukhari"},
{"text":"Allah's Apostle said, \"One prayer in my Mosque is better than one thousand prayers in any other mosque except Al-Masjid-AI-Haram.\"","reference":"Sahih Bukhari"},
{"text":"The Prophet (p.b.u.h) said, \"The best charity is that which is practiced by a wealthy person. And start giving first to your dependents.\"","reference":"Sahih Bukhari"},
{"text":"The Prophet said to me, \"Do not withhold your money, (for if you did so) Allah would with-hold His blessings from you.\"","reference":"Sahih Bukhari"},
{"text":"Allah's Apostle said, \"There are angels guarding the entrances (or roads) of Medina, neither plague nor Ad-Dajjal will be able to enter it.\"","reference":"Sahih Bukhari"},
{"text":"Allah's Apostle said, \"The people will remain on the right path as long as they hasten the breaking of the fast.\"","reference":"Sahih Bukhari"},
{"text":"The Prophet said, \"A time will come when one will not care how one gains one's money, legally or illegally.\"","reference":"Sahih Bukhari"},
{"text":"Allah's Apostle said, \"May Allah's mercy be on him who is lenient in his buying, selling, and in demanding back his money.\"","reference":"Sahih Bukhari"},
{"text":"The Apostle of Allah (may peace be upon him) used to remember Allah at all moments.","reference":"Sahih Muslim"},
{"text":"Bilal was commanded (by the Holy Prophet) to repeat the phrases twice in Adhan, and once in lqama.","reference":"Sahih Muslim"},
{"text":"The Prophet (pbuh) said: Iman has over seventy branches, and modesty is a branch of Iman.","reference":"Sahih Muslim"},
{"text":"The Apostle (pbuh) observed: When a man calls his brother an unbeliever, it returns (at least) to one of them.","reference":"Sahih Muslim"},
{"text":"The Apostle of Allah observed: The best of' the deeds or deed is the (observance of) prayer at its proper time and kindness to the parents.","reference":"Sahih Muslim"},
{"text":"The Apostle of Allah (pbuh) observed: He who as in his heart the weight of a mustard seed of pride shall not enter Paradise.","reference":"Sahih Muslim"},
{"text":"The Messenger of Allah (may peace be upon him) said: The Hour (Resurrection) would not come upon anyone so long as he supplicates Allah.","reference":"Sahih Muslim"},
{"text":"The Messenger of Allah (pbuh) loved to start from the right-hand side for performing ablution, for combing (the hair) and wearing the shoes.","reference":"Sahih Muslim"},
{"text":"The Messenger of Allah (may peace be upon him) said: When the Muadhin calls to prayer, Satan runs back vehemently.","reference":"Sahih Muslim"},
{"text":"The earth has been made for me purifying and as a mosque (place for prayer).","reference":"Sunan Abu Dawood"},
{"text":"The supplication made between the adhan and the iqamah is not rejected.","reference":"Sunan Abu Dawood"},
{"text":"Let the best among you call the adhan for you, and the Quran-readers act as your imams.","reference":"Sunan Abu Dawood"},
{"text":"The Prophet (p.b.u.h) said: The best of you are those whose shoulders are soft in prayer.","reference":"Sunan Abu Dawood"},
{"text":"The Prophet (p.b.u.h) said: Have the imam in the centre and close up the gaps.","reference":"Sunan Abu Dawood"},
{"text":"Your mouths are the paths of the Quran, so perfume them with the tooth stick","reference":"Sunan Ibn Majah"},
{"text":"The Messenger of Allah (saw) used to remember Allah in all circumstances.","reference":"Sunan Ibn Majah"},
{"text":"The Messenger of Allah (saw) used to make his prayer brief but perfect.","reference":"Sunan Ibn Majah"},
{"text":"The Messenger of Allah (saw) said: \"Beautify the Quran with your voices.\"","reference":"Sunan Ibn Majah"},
{"text":"The Messenger of Allah (saw) said: 'Patience should come with the first shock.\"","reference":"Sunan Ibn Majah"},
{"text":"The Messenger of Allah (saw) said: \"Eat Suhur, for in Suhur there is a blessing.\"","reference":"Sunan Ibn Majah"},
{"text":"The Messenger of Allah (saw) forbade fasting on the Day of Fitr and the Day of Adha.","reference":"Sunan Ibn Majah"},
{"text":"The Prophet (saw) said: \"A grateful eater is equal to a patient fasting person.\"","reference":"Sunan Ibn Majah"},
{"text":"The Messenger of Allah (saw) said: \"The best of you are those who are best to their womenfolk.\"","reference":"Sunan Ibn Majah"},
{"text":"The Messenger of Allah (saw) said: \"The most hated of permissible things to Allah is divorce.\"","reference":"Sunan Ibn Majah"},
{"text":"The Messenger of Allah (saw) said: 'Do not take oaths by idols nor by your forefathers.\"","reference":"Sunan Ibn Majah"},
{"text":"The Messenger of Allah (saw) said: \"An oath (leads to) either sin or regret.\"","reference":"Sunan Ibn Majah"},
{"text":"The Messenger of Allah (saw) said: \"Your oath is as your companion understands it to be.\"","reference":"Sunan Ibn Majah"},
{"text":"The Messenger of Allah (saw) said: \"Whoever achieves at something, let him stick with It.\"","reference":"Sunan Ibn Majah"},
{"text":"The Messenger of Allah (saw) said: \"No one hoards but a sinner.\"","reference":"Sunan Ibn Majah"},
{"text":"The Messenger of Allah (saw) said: \"When you weigh, allow more.\"","reference":"Sunan Ibn Majah"},
{"text":"The Prophet (saw) said: \"O Allah, bless my nation in their early mornings.\"","reference":"Sunan Ibn Majah"},
{"text":"The Messenger of Allah (saw) said: \"Do not take back your charity.\"","reference":"Sunan Ibn Majah"},
{"text":"The Messenger of Allah (saw) said: \"Give the worker his wages before his sweat dries.\"","reference":"Sunan Ibn Majah"},
{"text":"The Messenger of Allah (saw) said: 'Do Wudu properly.'","reference":"Sunan An-Nasai"},
{"text":"The Messenger of Allah (saw) said: Whoever is in the Masjid waiting for the prayer, he is in a state of prayer.","reference":"Sunan An-Nasai"},
{"text":"The Prophet (saw) said: One of the portents of the Hour will be that people will show off in building Masjids.","reference":"Sunan An-Nasai"},
{"text": "Abu Bakr Raḍiyallāhu 'anhu narrates that Rasulullah Ṣallallāhu 'alaihi wasallam said: He who accepts from me the Kalimah, which I presented to my uncle (Abu Talib at the time of his death) and he rejected it, this will be a means for his salvation","reference": "Musnad Aḥmad"},
{"text": "Umar Raḍiyallāhu 'anhu narrates Nabī Ṣallallahu 'alaihi wasallam said: O son of Khaṭṭāb! Go and announce amongst the people that indeed none shall enter Paradise except the Mu'minūn (believers)","reference": "Muslim"},
{"text": "Abu Laila Radiyallahu anhu narrates that Nabi Sallallahu alaihi wasallam said: Woe to you O Abu Sufyan! Indeed I have come to you with (the success of) this world and the Hereafter, so accept Islām, and enter into safety","reference": "Ṭabarānī, Majma-'uz-Zawāid"},
{"text": "Anas ibne-Malik Radiyallahu anhu narrates that Rasulullah Şallallahu 'alaihi wasallam said: Good tidings to the one who has believed in me and seen me; and good tidings seven times over to the one who has believed in me and has not seen me","reference": "Musnad Aḥmad"},
{"text": "Amr ibne-'Abasah Raḍiyallahu 'anhu asked: Which Iman is the best? Nabi Şallallahu 'alaihi wasallam replied: Hijra (generally it means migration). And then asked: What is Hijra? Nabi Sallallahu 'alaihi wasallam replied: To forsake evil","reference": "Masnad Aḥmad"},
{"text": "Uthman ibne-'Affan Raḍiyallāhu 'anhu narrates that Rasulullāh Şallallahu 'alaihi wasallam said: He, who died knowing (and believing) that there is none worthy of worship except Allāh, will enter Paradise","reference": "Muslim"},
{"text": "Uthman ibne-'Affan Radiyallāhu 'anhu narrates that Rasulullāh Şallallahu 'alaihi wasallam said: He, who died knowing that Allah is True and He exists, will enter Paradise","reference": "Musnad Abu Ya'lā"},
{"text": "Ubadah ibne-Ṣāmit Raḍiyallāhu 'anhu said: I heard Rasulullāh Şallallahu 'alaihi wasallam saying: He who died not ascribing any partner to Allāh, Allāh indeed forbids the Fire upon him","reference": "Amalul Yaumi wal Lailah lin Nasaĩ"},
{"text": "Nawwās ibne-Sam'ān Raḍiyallāhu 'anhu narrates that he heard Nabi Şallallahu 'alaihi wasallam saying: He who dies, not ascribing any partner to Allāh, indeed, forgiveness becomes incumbent for him","reference": "Tabarānī, Majma-'uz-Zawāid"},
{"text": "Abu Hurairah Raḍiyallahu 'anhu narrates that Nabī Ṣallallāhu 'alaihi wasallam said: Iman is that you believe in Allah, and His angels, and meeting Him (in the Hereafter), and His Messengers, and that you believe in the Resurrection","reference": "Bukhārī"},
{"text": "Umar ibnil-Khaṭṭāb Radiyallahu 'anhu narrates that he heard Nabi Şallallahu 'alaihi wasallam saying: He who dies believing in Allāh, and the Last Day, it will be said to him: Enter from any of the eight doors of Paradise that you wish","reference": "Musnad Aḥmad"},
{"text": "Abu Hurairah Raḍiyallāhu 'anhu reported that Nabi Sallallahu 'alaihi wasallam in a Ḥadīth Qudsi said: When Allah had created the creation, He wrote in His Book which is with Him above the Throne: Indeed My Mercy prevails over My Anger","reference": "Muslim"},
{"text": "Abu Hurairah Raḍiyallāhu 'anhu narrates that Nabī Șallallāhu 'alaihi wasallam said: He who holds fast to my Sunnah during the time of corruption in my Ummah, for him is the reward of a Martyr","reference": "Tabarani, Targhib"},
{"text": "Irbāḍ ibne-Sariyah Raḍiyallahu 'anhu, the companion of Rasulullah Sallallahu 'alaihi wasallam narrates: I heard Rasulullah Şallallahu 'alaihi wasallam saying: Verily I am the slave of Allāh and the seal of prophets","reference": "Mustadrak Ḥākim"},
{"text": "Abdullah ibne-'Amr Raḍiyallāhu 'anhuma narrates that Nabī Şallallahu 'alaihi wasallam said: No person is a true believer until he believes that destiny, good and bad, is from Allāh","reference": "Musnad Aḥmad"},
{"text": "Abdullah ibne-'Umar Raḍiyallahu 'anhuma narrates that Rasulullah Şallallahu 'alaihi wasallam said: Every thing is destined, even mental weakness and intelligence","reference": "Muslim"},
{"text": "Ibne-'Abbās Raḍiyallahu 'anhuma narrates that Abu Bakr Radiyallahu 'anhu said: O Rasulallah! Indeed you have aged! He replied: (The Sūrah) Hūd, Al-Waqi'ah, Al-Mursalāt, 'Amma Yata Sā'alun, and Idhash Shamsu Kuwwirat have aged me","reference": "Tirmidhī"},
{"text": "Abdullāh Raḍiyallahu 'anhu narrates that Nabī Ṣallallāhu 'alaihi wasallam said: The Last Hour will come only upon the most wicked people","reference": "Muslim"},
{"text": "Anas ibne-Malik Raḍiyallāhu 'anhu narrates that Rasulullāh Şallallahu 'alaihi wasallam said: My intercession will be for those of my Ummah who have committed major sins","reference": "Tirmidhī"},
{"text": "Sahl ibne-Sa'd Al Sa'īdī Raḍiyallāhu 'anhu narrates that Rasulullah Şallallāhu 'alaihi wasallam said: The space that a whip occupies in Paradise is better than the world and what it contains","reference": "Bukhari"},
{"text": "Faḍālah ibne-'Ubaid Radiyallahu 'anhu narrates that Nabi Şallallahu 'alaihi wasallam said: The Mujahid (one striving in the Path of Allah) is he who fights against his personal desires","reference": "Tirmidhi"},
{"text": "Abu Hurairah Raḍiyallahu 'anhu narrates that Rasulullāh Şallallahu 'alaihi wasallam said: The world is a believer's prison, and an unbeliever's Paradise","reference": "Muslim"},
{"text": "Abu Hurairah Raḍiyallāhu 'anhu narrates that Nabī Ṣallallāhu 'alaihi wasallam said: Anyone of you who leaves his home to come to my masjid, for every footstep a virtue is written, and for every other footstep a sin is erased, until he returns","reference": "Ibne-Ḥibbān"},
{"text": "Jabir ibne-'Abdullah Raḍiyallahu 'anhuma narrates that Nabī Şallallahu 'alaihi wasallam said: The key to Paradise is Șalat and the key to Ṣalāt is Wuḍū","reference": "Musnad Ahmad"},
{"text": "Anas Radiyallāhu 'anhu narrates that Rasulullāh Şallallāhu 'alaihi wasallam said: The comfort and delight of my eyes has been placed in Şalāt","reference": "Nasai"},
{"text": "Umar Radiyallahu 'anhu narrates that Rasulullah Şallallāhu 'alaihi wasallam said: Salat is a pillar of Deen","reference": "Hilyat-ul-Awliya, Jami -'uş-Şaghir"},
{"text": "Uthman ibne-'Affān Raḍiyallāhu 'anhu narrates that Rasūlullāh Şallallahu 'alaihi wasallam said: He who believes that Ṣalāt is the obligatory right (of Allāh) will enter Paradise","reference": "Musnad Aḥmad, Abu Ya'lā, Bazzar, Majma'uz-Zawāid"},
{"text": "Abu Hurairah Raḍiyallahu 'anhu narrates that Rasulullah Şallallahu 'alaihi wasallam said: He who guards the obligatory Șalāt will not be written amongst the neglectful","reference": "Ibne Khuzaimah"},
{"text": "Abu Mālik Al Ashja'ī narrates from his father Raḍiyallahu 'anhuma, who said that whenever a man accepted Islām during the time of Nabi Şallallāhu 'alaihi wasallam, the Sahābah used to teach him Şalāt","reference": "Tabarānī"},
{"text": "Hasan ibne-'Alī Raḍiyallahu 'anhuma narrates that Rasulullāh Şallallahu 'alaihi wasallam said: He who recites Ayatul Kursi after obligatory Șalāt, is in the protection of Allah till the next Ṣalāt","reference": "Tabarānī, Majma'uz-Zawāid"},
{"text": "Umme Farwah Raḍiyallāhu 'anhā narrates that Rasulullāh Şallallahu 'alaihi wasallam was asked: Which is the best of the good deeds? He said: To offer Şalāt at the beginning of its prescribed time","reference": "Abu Dawud"},
{"text": "Ali Radiyallāhu 'anhu narrates that Rasulullah Şallallahu 'alaihi wasallam said: O People of the Qur'an! Offer Witr Şalāt, for verily Allāh is Witr, and He loves the Witr","reference": "Abu Dawud"},
{"text": "Jabir ibne-Abdullah Radiyallahu 'anhuma narrates: I heard Rasulullah Şallallahu 'alaihi wasallam saying: Between man and (his entering into) polytheism and unbelief is the abandonment of Salāt","reference": "Muslim"},
{"text": "Ibne-'Abbās Raḍiyallahu 'anhuma narrates that Rasulullāh Şallallahu 'alaihi wasallam said: He who abandons Şalat shall meet Allāh in a state that Allah will be very angry with him","reference": "Bazzar, Tabarānī, Majma uz-Zawāid"},
{"text": "Naufal ibne-Mu'awiya Raḍiyallahu 'anhu narrates that Nabī Sallallahu 'alaihi wasallam said: The person who missed even one Șalāt is as though he has been deprived of his entire family and wealth","reference": "Ibne-Hibban"},
{"text": "Sahl ibne-Sa'd Raḍiyallahu 'anhu narrates that Rasulullah Ṣallallahu 'alaihi wasallam said: Two things are never rejected or seldom rejected; Du'a at the time of Ādhān and at the time when people are locked in a furious battle","reference": "Abu Dawūd"},
{"text": "Sa'd ibne-Abi Waqqas Radiyallahu anhu narrates that Rasulullah Şallallahu 'alaihi wasallam said: The one who hears the Muadhdhin and responds with (the following), his sins will be forgiven","reference": "Muslim"},
{"text": "Jābir Radiyallahu 'anhu narrates that Rasulullah Sallallāhu 'alaihi wasallam said: When the Iqamah for Ṣalāt is being said, the doors of the skies are opened, and Du'ā is accepted","reference": "Musnad Aḥmad"},
{"text": "Abu Hurairah Radiyallahu 'anhu narrates that Rasulullāh Şallallahu 'alaihi wasallam said: Those who frequent the masjids in darkness, undoubtedly are the people who are immersed in Allah's Mercy","reference": "Ibne-Mājah, Targhīb"},
{"text": "Buraidah Raḍiyallahu 'anhu narrates that Nabī Ṣallallāhu 'alaihi wasallam said: Good tidings for those who frequent the masjids in darkness, of complete Nür (light) on the Day of Resurrection","reference": "Abu Dawud"},
{"text": "Irbädh ibne-Sariyah Raḍiyallāhu 'anhu narrates that Rasulullāh Ṣallallahu 'alaihi wasallam used to pray for forgiveness three times for the first row and once for the second row","reference": "Ibne-Majah"},
{"text": "A'ishah Radhiallāhū 'anhã narrates that Rasulullah Şallallāhu 'alaihi wasallam said: Verily Allah sends Mercy and His angels invoke blessings for those who fill in the gaps to complete the rows","reference": "Mustadrak Hakim"},
{"text": "Abu Hurairah Raḍiyallahu 'anhu narrates that Rasulullah Şallallahu 'alaihi wasallam said: Whoever joins a row (of Ṣalāt), Allah raises him one rank; and the angels shower (Allāh's) blessings upon him","reference": "Tabarānī, Targhīb"},
{"text": "Abu Juḥaifah Raḍiyallāhu 'anhu narrates that Nabī Ṣallallāhu 'alaihi wasallam said: He who fills the gap in a row (of Ṣalāt) is forgiven ","reference": "Bazzār, Majma'uz-Zawāid"},
{"text": "Anas Raḍiyallahu 'anhu narrates that Nabī Ṣallallahu 'alaihi wasallam said: Straighten your rows, for the straightening of the rows in Salāt is essential for the offering of Șalāt correctly","reference": "Bukhārī"},
{"text": "Umar ibnil Khattab Radiyallahu anhu narrates: I heard Rasulullah Şallallahu 'alaihi wasallam saying: Allah Subḥānahu wa Ta'ālā indeed admires the people offering Șalat in congregation","reference": "Musnad Ahmad, Majmauz-Zawaid"},
{"text": "Abdullah ibne-Mas'ud Raḍiyallāhu 'anhu narrates that Rasulullah Şallallahu 'alaihi wasallam said: The excellence of a person's Șalāt in congregation is even greater than twenty times as compared to his individual Ṣalāt","reference": "Musnad Aḥmad"},
{"text": "Abu Hurairah Raḍiyallahu 'anhu narrates that Rasulullāh Şallallahu 'alaihi wasallam said: The reward of Șalāt offered by a person in congregation is twenty five times greater as compared to that Ṣalat offered by him alone in his house or place of business","reference": "Bukhārī"},
{"text": "Abu Hurairah Raḍiyallahu 'anhu narrates that Rasulullāh Şallallahu 'alaihi wasallam said once on a Friday: O Community of Muslims! Allah has made this day an 'Eid for you, so take a bath and heedfully brush your teeth with Siwak (toothstick)","reference": "Tabarānī, Majma'uz-Zawaid"},
{"text": " Abu Umāmah Raḍiyallahu 'anhu narrates that Rasulullāh Şallallahu 'alaihi wasallam said: Indeed the bath, taken on Friday, removes sins even to the extent of removing them from the roots of the hair","reference": "Tabarānī, Majma'uz-Zawāid"}
]
